cases/chpt4-ss304-2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    sym
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          2880;
        startFace       336960;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4800;
        startFace       339840;
    }
    btm
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4800;
        startFace       344640;
    }
    side1Andside2Andside3
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4800;
        startFace       349440;
    }
)

// ************************************************************************* //
